{
    "whatsappErrorCodes": {
        "0": "Unauthorized - Invalid access token",
        "3": "Token doen't have permissions issue",
        "4": "The app has reached its API call rate limit.",
        "33": "The business phone number has been deleted.",
        "100": "The request included one or more unsupported or misspelled parameters.",
        "190": "Access token has expired",
        "80007": "The WhatsApp Business Account has reached its rate limit.",
        "130429": "Cloud API message throughput (Rate limit hit) has been reached.",
        "130472": "customer service window or markenting or free-entry point conversation existis",
        "130497": "The WhatsApp Business Account is restricted from messaging to users in certain countries",
        "131000": "Message failed to send due to an unknown error.(Try again)",
        "131008": "The request is missing a required parameter.",
        "131009": "One or more parameter values are invalid.",
        "131016": "A service is temporarily unavailable.(Try again)",
        "131021": "Sender and recipient phone number is the same.",
        "131026": "The recipient phone number is not a WhatsApp phone number or Recipient has not accepted our new Terms of Service and Privacy Policy",
        "131031": "The WhatsApp Business Account has been locked (Message templates can only be sent out if they are approved)",
        "131042": "Business eligibility payment issue (Payment account is not attached to a WhatsApp Business Account)",
        "131045": "Message failed to send due to a business phone number registration error. (Try again after phone number registeration)",
        "131047": "More than 24 hours have passed since the recipient last replied to the sender number.",
        "131048": "Message failed to send because, messages were blocked or flagged as spam.",
        "131049": "This message was not delivered to maintain healthy ecosystem engagement",
        "131051": "Unsupported message type.",
        "131052": "Media download error - Unable to download the media sent by the user",
        "131053": "Media upload error - Unable to upload the media used in the message.",
        "131056": "Too many messages sent from the sender phone number to the same recipient phone number in a short period of time.",
        "131057": "Buiness Account is in maintenance mode",
        "132000": "Template Param Count Mismatch",
        "132001": "The template does not exist in the specified language or the template has not been approved.",
        "132005": "Template Hydrated Text Too Long",
        "132007": "Template content violates a WhatsApp policy.",
        "132012": "Template Parameter Format Mismatch",
        "132015": "Template is paused due to low quality so it cannot be sent in a template message.(Try again once it is approved)",
        "132016": "Template has been paused too many times due to low quality and is now permanently disabled.",
        "132068": "Flow is in blocked state.",
        "132069": "Flow is in throttled state and 10 messages using this flow were already sent in the last hour.",
        "133000": "A previous deregistration attempt failed.",
        "133004": "Server is temporarily unavailable.",
        "133005": "Two-step verification PIN incorrect.",
        "133006": "Phone number needs to be verified before registering.",
        "133008": "Too many two-step verification PIN guesses for this phone number.(Try again after the amount of time)",
        "133009": "Two-step verification PIN was entered too quickly",
        "133010": "Phone number not registered on the WhatsApp Business Platform.",
        "133015": "TThe phone number you are attempting to register was recently deleted, and deletion has not yet completed.(Wait 5 minutes before re-trying the request.)",
        "133016": "Registration or Deregistration failed because there were too many attempts for this phone number in a short period of time",
        "135000": "Message failed to send because of an unknown error with your request parameters.",
        "2593107": "You have exceeded the maximum number of times to call the synchronization api for this phone number.",
        "2593108": "Synchronization request can only be made within 24 hours of onboarding"
    }
}