{
    "whatsappErrorCodes": {
        "0":{ "message": "Unauthorized - Invalid access token", "solution":"Typically this means the included access token has expired. We recommend that you get a new access token."},
        "1":{ "message": "Invalid request or possible server error.", "solution":"Check the **WhatsApp Business Platform Status** page to see API status information"},
        "2":{ "message": "API service is temporary due to downtime or due to being overloaded.", "solution":"Check the **WhatsApp Business Platform Status** page to see API status information"},
        "3":{ "message": "Token doen't have permissions issue", "solution":"verify that your app has been granted the permissions required by the endpoint"},
        "4":{ "message": "The app has reached its API call rate limit.", "solution":"Check the **App Dashboard** for rate limits; if exceeded, wait before retrying or reduce API query frequency."},
        "10":{ "message": "Permission is either not granted or has been removed.", "solution":"verify that your app has been granted the permissions required by the endpoint"},
        "33":{ "message": "The business phone number has been deleted.", "solution":"Verify that the business phone number is correct."},
        "100":{ "message": "The request included one or more unsupported or misspelled parameters.", "solution":"See the endpoint's reference to determine which parameters are supported and how they are spelled. Ensure your parameter is under any length restriction for the type."},
        "190":{ "message": "Access token has expired", "solution":"We recommend that you get a new access token."},
        "368":{ "message": "Temporarily blocked for policies violations", "solution":"See the **Policy Enforcement** document to learn about policy violations and how to resolve them."},
        "80007":{ "message": "The WhatsApp Business Account has reached its rate limit.", "solution":"Check WhatsApp Business Account rate limits; if exceeded, wait before retrying or reduce API query frequency."},
        "130429":{ "message": "Cloud API message throughput (Rate limit hit) has been reached.", "solution":"The app has hit the API throughput limit; wait before retrying or reduce message-sending frequency."},
        "130472":{ "message": "Customer service window or markenting or free-entry point conversation existis", "solution":"Contact the customer via a non-WhatsApp method and ask them to message you, allowing you to resend within the service window."},
        "130497":{ "message": "The WhatsApp Business Account is restricted from messaging to users in certain countries", "solution":"See **WhatsApp Business Messaging Policy** for details on allowed countries for messaging in your business category."},
        "131000":{ "message": "Message failed to send due to an unknown error.", "solution":"Try again. If the error persists, open a **Direct Support** ticket."},
        "131005":{ "message": "Permission is either not granted or has been removed.", "solution":"verify that your app has been granted the permissions required by the endpoint"},
        "131008":{ "message": "The request is missing a required parameter.", "solution":"See the **Whatsapp cloud api endpoint's reference** to determine which parameters are required."},
        "131009":{ "message": "One or more parameter values are invalid.", "solution":"See the **Whatsapp cloud api endpoint's reference** to determine which parameters are required."},
        "131016":{ "message": "A service is temporarily unavailable.", "solution":"Check the **WhatsApp Business Platform Status** page to see API status information before trying again."},
        "131021":{ "message": "Sender and recipient phone number is the same.", "solution":"Send a message to a phone number different from the sender."},
        "131026":{ "message": "The recipient's phone number is not registered with WhatsApp or they have not accepted the latest Terms of Service and Privacy Policy.", "solution":"Ask the recipient to confirm their WhatsApp registration and accept (update) the latest Terms of Service and Privacy Policy in their app settings."},
        "131031":{ "message": "The WhatsApp Business Account has been locked (Message templates can only be sent out if they are approved)", "solution":"See the **Policy Enforcement** document to learn about policy violations and how to resolve them."},
        "131037":{ "message": "WhatsApp provided number needs display name approval before message can be sent.", "solution":"Change the 555 business phone number's display name. See our **How to change your WhatsApp Business display name** Help Center article to learn how"},
        "131042":{ "message": "Business eligibility payment issue", "solution":"Verify your **WhatsApp Business Account** billing setup, ensure an active payment method, and check for account suspensions or missing settings."},
        "131045":{ "message": "Message failed to send due to a business phone number registration error.", "solution":"**Register the phone number** before trying again."},
        "131047":{ "message": "More than 24 hours have passed since the recipient last replied to the sender number.", "solution":"Send the recipient a business-initiated message using a **message template** instead."},
        "131048":{ "message": "Message failed to send because, messages were blocked or flagged as spam.", "solution":"Check your quality status in WhatsApp Manager and review the **Quality-Based Rate Limits** documentation."},
        "131049":{ "message": "This message was not delivered to maintain healthy ecosystem engagement", "solution":"If the error is due to limits, avoid immediate retries and increase the retry interval gradually until the message is delivered."},
        "131051":{ "message": "Unsupported message type.", "solution":"See **Whatsapp Cloud API Messages** for supported message types before trying again with a supported message type"},
        "131052":{ "message": "Media download error", "solution":"We were unable to download media included in the WhatsApp user's message. Ask the WhatsApp user to send you the media file using a non-WhatsApp method."},
        "131053":{ "message": "Media upload error", "solution":"The media upload failed due to an unsupported format; verify the file's MIME type and ensure it is supported before retrying"},
        "131056":{ "message": "Too many messages sent from the sender phone number to the same recipient phone number in a short period of time.", "solution":"Wait before retrying for the same phone number; messaging other numbers is still allowed."},
        "131057":{ "message": "Buiness Account is in maintenance mode", "solution":"The WhatsApp Business Account is in maintenance mode, possibly due to a throughput upgrade; wait until the maintenance is complete before retrying."},
        "132000":{ "message": "Template Param Count Mismatch", "solution":"Ensure that all variable parameters in the message template are correctly included as per the Message Template Guidelines."},
        "132001":{ "message": "The template does not exist in the specified language or the template has not been approved.", "solution":"Make sure your template has been approved and the template name and language locale are correct."},
        "132005":{ "message": "Template Hydrated (Translated) Text Too Long", "solution":"Check the WhatsApp Manager to verify that your template has been translated."},
        "132007":{ "message": "Template content violates a WhatsApp policy.", "solution":"See **Template Rejection Reasons** to determine possible reasons for violation."},
        "132012":{ "message": "Template Parameter Format Mismatch", "solution":"he variable parameter values included in the request are not using the format specified in the template."},
        "132015":{ "message": "Template is paused due to low quality so it cannot be sent in a template message.", "solution":"Edit the template to improve its quality and try again once it is approved."},
        "132016":{ "message": "Template has been paused too many times due to low quality and is now permanently disabled.", "solution":"Create a new template with different content."},
        "132068":{ "message": "Flow is in blocked state.", "solution":"Correct the Flow"},
        "132069":{ "message": "Flow is in throttled state and 10 messages using this flow were already sent in the last hour.", "solution":"Correct the Flow"},
        "133000":{ "message": "A previous deregistration attempt failed.", "solution":"**Deregister** the phone number again before registering."},
        "133004":{ "message": "Server is temporarily unavailable.", "solution":"Check the **WhatsApp Business Platform Status** page for API status and review the response details before retrying."},
        "133005":{ "message": "Two-step verification PIN incorrect.", "solution":"Ensure the two-step verification PIN is correct; if needed, disable it and send a POST request with the new PIN to the Phone Number endpoint."},
        "133006":{ "message": "Phone number needs to be verified before registering.", "solution":"Verify the phone number before registering it."},
        "133008":{ "message": "Too many two-step verification PIN guesses for this phone number.", "solution":"Try again after the amount of time specified in the details response value."},
        "133009":{ "message": "Two-step verification PIN was entered too quickly", "solution":"Check the details response value before trying again."},
        "133010":{ "message": "Phone number not registered on the WhatsApp Business Platform.", "solution":"Register the phone number before trying again."},
        "133015":{ "message": "The phone number you are attempting to register was recently deleted, and deletion has not yet completed.",  "solution":"Wait 5 minutes before re-trying the request."},
        "133016":{ "message": "Registration or deregistration failed due to too many attempts in a short period for this phone number.", "solution":"The business phone number is blocked due to excessive registration attempts; wait until it is unblocked and check the Registration limitations."},
        "135000":{ "message": "Message failed to send because of an unknown error with your request parameters.", "solution":"Verify the endpoint syntax in the **Whatsapp Cloud API reference** documentation; contact customer support if the error persists"},
        "2593107":{ "message": "synchronization API call limit exceeded for this phone number.", "solution":"This endpoint can only be called once for contact and message history sync; to resolve issues, offboard and re-onboard the business customer."},
        "2593108":{ "message": "Synchronization request can only be made within 24 hours of onboarding",  "solution":"Contact and message history synchronization is allowed only within 24 hours of an onboarding; offboard and re-onboard the user if needed."},
        "200-299":{ "message": "Permission is either not granted or has been removed.", "solution":"verify that your app has been granted the permissions required by the endpoint"}
    }
}